### step-1 importing packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### step-2 Creatint Df using list

In [2]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names,index=[1,2,3],columns=['Names'])

    Names
1  Ramesh
2  Suresh
3  Mahesh

### step-3 Data and Columns

In [3]:
names=['Ramesh','Suresh','Mahesh']
Df=pd.DataFrame(names,index=[1,2,3],columns=['Names'])
Df

    Names
1  Ramesh
2  Suresh
3  Mahesh

### step -4 Multiple columns

In [4]:
names=['Ramesh','sureh']
age=[20,22]
df=pd.DataFrame(zip(names,age),columns=['Name','Age'])       # zip 2 columns  for the output look same as below.
df

     Name  Age
0  Ramesh   20
1   sureh   22

### step-5 adding column to existed Dataframe

- in above first we have taken data
- then created a dataframe
- now i need to add another column

In [5]:
city=['Hyd','Banglore']
df['city']=city

marks=[20,30]
df['marks']=marks
df

     Name  Age      city  marks
0  Ramesh   20       Hyd     20
1   sureh   22  Banglore     30

### step-6 Updating the column with new values

In [6]:
df['marks']=[200,400]
df

     Name  Age      city  marks
0  Ramesh   20       Hyd    200
1   sureh   22  Banglore    400

### step-7 creating empty dataframe and add columns

In [7]:
df1=pd.DataFrame()
df1['Names']=['Ramesh','Suresh','Mahesh']
df1['Age']=[20,21,22]
df1['City']=['Hyd','Pune','Banglore']
df1['Marks']=[80,90,95]
df1

    Names  Age      City  Marks
0  Ramesh   20       Hyd     80
1  Suresh   21      Pune     90
2  Mahesh   22  Banglore     95

### step-8 Create Dataframe using dictionary

In [8]:
details={
    'Names' :['Ramesh','Suresh','Mahesh'],
    'Age':[20,21,22],
    'City':['Hyd','Pune','Banglore']
}
df11=pd.DataFrame(details,index=[1,2,3])
df11

    Names  Age      City
1  Ramesh   20       Hyd
2  Suresh   21      Pune
3  Mahesh   22  Banglore

In [9]:
details={
    'Names' :'Ramesh',
    'Age':20,
    'City':'Hyd'
}
df1=pd.DataFrame(details)   # if you dont mention index it will give you error. 
df1

ValueError: If using all scalar values, you must pass an index

In [ ]:
details={
    'Names' :'Ramesh',
    'Age':20,
    'City':'Hyd'
}
df1=pd.DataFrame(details,[1])   # if you dont mention index it will give you error. 
df1

### step-9 save the dataframe

In [ ]:
df11.to_csv('Example_df.csv')

In [ ]:
df11.to_excel('Example2_df.xlsx')

### Step 10 Read the Dataframe

In [ ]:
df=pd.read_csv('Example_df.csv',)
df

In [ ]:
pd.read_excel('Example2_df.xlsx')

In [ ]:
details={
    'Names' :['Ramesh','Suresh','Mahesh'],
    'Age':[20,21,22],
    'City':['Hyd','Pune','Banglore']
}
df11=pd.DataFrame(details,index=[1,2,3])
df11

In [ ]:
df11.to_csv('Example3_df.csv',index=False)

In [ ]:
pd.read_csv('Example3_df.csv')

In [ ]:
df11.to_excel('Example4_df.xlsx',index=False)

In [ ]:
pd.read_excel('Example4_df.xlsx')

In [ ]:
marks=[100,80,95]
df11['Marks']=marks
df11

### step 11 Drop the column

In [ ]:
df11.drop(['Marks'],axis='columns')

In [ ]:
df11.drop(index=2)

In [ ]:
df11.drop(columns=['City','Marks'])

In [ ]:
df11.drop('Marks')

In [ ]:
df11.drop('Marks',axis=1)

In [ ]:
df11.drop(['City','Marks'],axis=1)

**inplace**

In [ ]:
# when we do the operation the result is not overwritting 
# the original dataframe same as it is.
# in order to this we need to use **inplace** argument . 
# by default inplace=False. 
# make inplace = True ,if you want to overwrite the result.

In [ ]:
df11.drop('Marks',axis=1,inplace=True)

In [ ]:
df11

### step 12 rename the column

In [ ]:
df11.rename(columns={'Names':'names','Age':'age','City':'city'},inplace=True)
df11

In [ ]:
df11.rename({1:'A',2:'B',3:'C'},axis=0,inplace=True)
df11

### step 13

In [11]:
x=list(range(1,11))
y=[i**2 for i in x]
z=[i**3 for i in x]
df_x=pd.DataFrame(zip(x,y,x),columns=['X','Y','Z'])
df_x

    X    Y   Z
0   1    1   1
1   2    4   2
2   3    9   3
3   4   16   4
4   5   25   5
5   6   36   6
6   7   49   7
7   8   64   8
8   9   81   9
9  10  100  10

- len
- shape
- size
- head
- tail
- isnull
- dtypes
- info

In [ ]:
len(df_x)

In [ ]:
df_x.shape

In [ ]:
df_x.size

In [ ]:
df_x.head()

In [ ]:
df_x.tail()

In [ ]:
df_x.isnull().sum()

In [ ]:
df_x.dtypes

In [14]:
df_x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

### step 14 selecting columns

In [15]:
df_x.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [ ]:
df_x[['X','Y']]

In [ ]:
type(df_x.X)

In [ ]:
type(df_x[['X','Y']])

In [ ]:
df_x.X.shape
#df_x[['X','Y']].shape

In [ ]:
df_x.Y.values

In [ ]:
df_x

In [ ]:
df_x.Z

In [ ]:
df_x.Z.values

In [ ]:
df_x[['Y','Z']].values

In [ ]:
df_x.Z.values.tolist()

In [ ]:
df_x
df_x.Z
df_x.Z.values
df_x[['Y','Z']].values
df_x.Z.values.tolist()